cf/Catalogs/MessageTemplates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>MessageTemplates</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Document.OutgoingEmail</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TemplateOwner</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.MessageTemplateOwner</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalDataProcessor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AdditionalReportsAndDataProcessors</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddAttachedFiles</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Purpose</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Sender</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SendInTransliteration</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SignatureAndSeal</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InputOnBasisParameterTypeFullName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ForSMSMessages</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ForInputOnBasis</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ForEmails</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TemplateTextArbitrary</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMSTemplateText</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MessageTemplateText</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTMLEmailTemplateText</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailSubject</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailTextType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EmailEditingMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AuthorOnly</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TransliterateFileNames</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PackToArchive</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AttachmentFormat</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TemplateByExternalDataProcessor</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>PrintFormsAndAttachments</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Parameters</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ParameterName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ParameterType</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ParameterPresentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Enums/EmailEditingMethods.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>EmailEditingMethods</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>NormalText</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/MessageTemplates/Ext/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

Procedure Filling(FillingData, FillingText, StandardProcessing)
	If FillingData <> Undefined Then
		
		If Common.SubsystemExists("StandardSubsystems.Interactions")
			And TypeOf(FillingData) = Type("DocumentRef.OutgoingEmail") Then
				FillOnBasisOutgoingEmail(FillingData, FillingText, StandardProcessing);
		ElsIf TypeOf(FillingData) = Type("Structure") Then 
				FillBasedOnStructure(FillingData, FillingText, StandardProcessing);
		EndIf;
		
	EndIf;
EndProcedure

#EndRegion

#Region Private

Procedure FillOnBasisOutgoingEmail(FillingData, FillingText, StandardProcessing)
	
	TemplateAttributes = New Array;
	TemplateAttributes.Add("Subject");
	TemplateAttributes.Add("HTMLText");
	TemplateAttributes.Add("Text");
	TemplateAttributes.Add("TextType");
	
	InfoAboutTemplate = Common.ObjectAttributesValues(FillingData, TemplateAttributes);
	
	EmailSubject                             = InfoAboutTemplate.Subject;
	HTMLEmailTemplateText                 = InfoAboutTemplate.HTMLText;
	MessageTemplateText                     = InfoAboutTemplate.Text;
	EmailSubject                             = InfoAboutTemplate.Subject;
	Description                           = InfoAboutTemplate.Subject;
	ForEmails        = True;
	ForSMSMessages                     = False;
	InputOnBasisParameterTypeFullName = NStr("en = 'Common';tr = 'Ortak'");
	EmailTextType = Enums.EmailEditingMethods.NormalText;
	
	If Common.SubsystemExists("StandardSubsystems.EmailOperations") Then
		ModuleEmailOperationsInternal = Common.CommonModule("EmailOperationsInternal");
		HTMLEmailsTextTypes = ModuleEmailOperationsInternal.EmailTextsType("HTML");
		HTMLEmailsWithPicturesTextsTypes = ModuleEmailOperationsInternal.EmailTextsType("HTMLWithPictures");
		
		If InfoAboutTemplate.TextType = HTMLEmailsTextTypes
			Or InfoAboutTemplate.TextType = HTMLEmailsWithPicturesTextsTypes Then
			EmailTextType = Enums.EmailEditingMethods.HTML;
		EndIf;
	
	EndIf;
	
EndProcedure

Procedure FillBasedOnStructure(FillingData, FillingText, StandardProcessing)
	
	TemplateParameters = MessageTemplates.TemplateParametersDetails();
	CommonClientServer.SupplementStructure(TemplateParameters, FillingData, True);
	
	FillPropertyValues(ThisObject, TemplateParameters);
	AttachmentFormat = New ValueStorage(TemplateParameters.AttachmentsFormats);
	
	If TypeOf(FillingData) = Type("Structure")
		And FillingData.Property("ForSMSMessages")
		And FillingData.ForSMSMessages Then
			TemplateParameters.TemplateType = "SMS";
	EndIf;
	
	If ValueIsFilled(TemplateParameters.ExternalDataProcessor) Then
		TemplateByExternalDataProcessor = True;
	EndIf;
	
	If ValueIsFilled(TemplateParameters.FullAssignmentTypeName) Then
		ObjectMetadata = Common.MetadataObjectByFullName(TemplateParameters.FullAssignmentTypeName);
		InputOnBasisParameterTypeFullName = TemplateParameters.FullAssignmentTypeName;
		Purpose= ObjectMetadata.Presentation();
		ForInputOnBasis = True;
	EndIf;
	
	If TemplateParameters.TemplateType = "MailMessage" Then
		
		ForSMSMessages              = False;
		ForEmails = True;
		EmailSubject                      = TemplateParameters.Subject;
		
		If TemplateParameters.EmailFormat1 = Enums.EmailEditingMethods.HTML Then
			HTMLEmailTemplateText = StrReplace(TemplateParameters.Text, Chars.LF, "<BR>");
			EmailTextType        = Enums.EmailEditingMethods.HTML;
		Else
			MessageTemplateText = StrReplace(TemplateParameters.Text, "<BR>", Chars.LF);
			EmailTextType    = Enums.EmailEditingMethods.NormalText;
		EndIf;
		
	ElsIf TemplateParameters.TemplateType = "SMS" Then
		
		ForSMSMessages              = True;
		ForEmails = False;
		SMSTemplateText                 = TemplateParameters.Text;
		SendInTransliteration            = TemplateParameters.Transliterate;
		
	Else
		ForSMSMessages              = False;
		ForEmails = False;
		TemplateTextArbitrary        = TemplateParameters.Text;
	EndIf;
	
	If TypeOf(TemplateParameters.PrintCommands) = Type("Array") Then
		
		For Each PrintCommand In TemplateParameters.PrintCommands Do
			String = PrintFormsAndAttachments.Add();
			String.Id = PrintCommand;
		EndDo;
		
	EndIf;
	
EndProcedure

#EndRegion

#Else
Raise NStr("en = 'Invalid object call on the client.';tr = 'İstemcide geçersiz nesne çağrısı.'");
#EndIf
